ConCho2/server/tests/load/load-test.yml
# ──────────────────────────────────────────────────────────
# TMS v2 — Load Test Configuration (Artillery)
# ──────────────────────────────────────────────────────────
# Run:  npx artillery run tests/load/load-test.yml
# Report: npx artillery run tests/load/load-test.yml --output report.json
#         npx artillery report report.json
# ──────────────────────────────────────────────────────────

config:
  target: "http://localhost:5000"
  phases:
    # Phase 1: Warm-up — 5 users/sec for 30 seconds
    - duration: 30
      arrivalRate: 5
      name: "Warm-up"
    # Phase 2: Ramp-up — 5 → 50 users/sec over 60 seconds
    - duration: 60
      arrivalRate: 5
      rampTo: 50
      name: "Ramp-up"
    # Phase 3: Sustained stress — 50 users/sec for 60 seconds
    - duration: 60
      arrivalRate: 50
      name: "Sustained Load"
  defaults:
    headers:
      Content-Type: "application/json"
  # Plugins for detailed metrics
  plugins:
    expect: {}

scenarios:
  # ── Scenario 1: Health Check (lightweight baseline) ──────
  - name: "Health Check"
    weight: 3
    flow:
      - get:
          url: "/api/health"
          expect:
            - statusCode: 200
            - hasProperty: "status"

  # ── Scenario 2: Login Flow ───────────────────────────────
  - name: "Login → Get Me → Logout"
    weight: 2
    flow:
      - post:
          url: "/api/auth/login"
          json:
            empCode: "000001"
            password: "admin12345!"
          capture:
            - json: "$.data.user._id"
              as: "userId"
          expect:
            - statusCode: 200
      - get:
          url: "/api/auth/me"
          expect:
            - statusCode: 200
      - post:
          url: "/api/auth/logout"
          expect:
            - statusCode: 200

  # ── Scenario 3: Public Read Endpoints ────────────────────
  - name: "Browse Classes & Schedules"
    weight: 3
    flow:
      - post:
          url: "/api/auth/login"
          json:
            empCode: "000001"
            password: "admin12345!"
      - get:
          url: "/api/classes"
          expect:
            - statusCode: 200
      - get:
          url: "/api/schedules?page=1&limit=20"
          expect:
            - statusCode: 200
      - get:
          url: "/api/teams"
          expect:
            - statusCode: 200

  # ── Scenario 4: Dashboard Analytics (expensive aggregation) ─
  - name: "Dashboard Analytics"
    weight: 1
    flow:
      - post:
          url: "/api/auth/login"
          json:
            empCode: "000001"
            password: "admin12345!"
      - get:
          url: "/api/dashboard/stats"
          expect:
            - statusCode: 200
      - get:
          url: "/api/dashboard/filter-options"
          expect:
            - statusCode: 200

  # ── Scenario 5: User Listing with Search (regex + pagination) ─
  - name: "User Search & Pagination"
    weight: 1
    flow:
      - post:
          url: "/api/auth/login"
          json:
            empCode: "000001"
            password: "admin12345!"
      - get:
          url: "/api/users?page=1&limit=50"
          expect:
            - statusCode: 200
      - get:
          url: "/api/users?search=test&page=1&limit=50"
          expect:
            - statusCode: 200
      - get:
          url: "/api/users?role=Participant&status=Active&page=1&limit=100"
          expect:
            - statusCode: 200